import librosa
import librosa.display
import matplotlib.pyplot as plt
import numpy as np

# 1. Зареждаме вграден примерен файл от библиотеката (истински глас/музика)
# Това ще изтегли малък файл автоматично при първото стартиране
filename = librosa.ex('nutcracker') 
y, sr = librosa.load(filename)

print(f"Файлът е зареден успешно!")
print(f"Продължителност: {len(y)/sr:.2f} секунди")
print(f"Sampling rate: {sr} Hz")

# 2. Извличаме MFCC характеристики (ключово за вашия детектор)
mfccs = librosa.feature.mfcc(y=y, sr=sr, n_mfcc=13)


"""Ако суровото аудио е просто една вълна, която се движи нагоре-надолу, то MFCC (Mel-Frequency Cepstral Coefficients) е начин да опишем формата на гласовия тракт 
(гърлото, езика, устните), който е създал този звук."""
"""Всеки ред (вертикално) съответства на определена характеристика на тембъра."""
"""Всяка колона (хоризонтално) е малък отрязък от време (няколко милисекунди)."""

"""Стойностите (числата):

    Първият коефициент (големите отрицателни числа като -602): Обикновено показва общата енергия или „силата“ на звука.

    Останалите коефициенти: Те описват специфичните честотни детайли. Те са тези, които правят разликата между звука „А“ и звука „О“, или между твоя глас и този на робот."""


print (mfccs)



# 3. Визуализация (за да разберете какво "вижда" вашият AI)

#plt.figure(figsize=(10, 4))
#librosa.display.specshow(mfccs, x_axis='time')
#plt.colorbar()
#plt.title('MFCC на тестовия файл')
#plt.tight_layout()
#plt.show()
